[
    {
        "id": 0,
        "category": "bonbon",
        "name": "Chocolate Frog with Personalised Wizard Card",
        "price": 28.00,
        "description": "Create your very own personalised wizard card for the ultimate Harry Potter gifting experience. Great for yourself or as the perfect gift for a treasured keepsake, unique to every Hogwarts student. The beloved and best-selling Chocolate Frog with Personalised Wizard Card will be sure to excite both chocolate lovers and collectors alike. Straight off the Hogwarts Express Sweets Trolley, the most famous wizarding confectionery, the Chocolate Frog, is now available to own with a personalised wizard card, designed by you. Packaged in a classic style violet and gold Honeydukes box, along with a delicious edible replica of the milk Chocolate Frog, this confectionery delight contains a collectable witch or wizard card starring you! This personalised chocolate frog features your chosen photo on the front of a high-quality glossy card, as well as a description of your Hogwarts house, wand core, and a selection of hobbies and favourite Hogwarts classes on the back. Now available to own and collect, along with a randomised wizard card including Professor Minerva McGonagall, Professor Dolores Umbridge, Neville Longbottom and the rarest card of them all, Harry Potter. Which card will you receive? All images shown are for promotional purposes only. Please allow an additional 7 working days for personalised items to be dispatched. Please note, that your Chocolate Frog with Personalised Wizard Card will be sent in a separate package to any other items in your order.",
        "ingredients": "Milk chocolate (Sugar, Whole Milk Powder, Cocoa Butter, Cocoa Mass, Emulsifier: Soya Lecithin, Natural Vanilla Flavouring). Milk chocolate contains cocoa solids 30% minimum, and milk solids 18% minimum.",
        "allergy_advice": "For allergens, please see ingredients in bold. May also contain traces of nuts. Store in a cool, dry place away from direct sunlight. Do not refrigerate. Nutritional information per 100g: Energy 2301/551Kj/kcal, Fat: 32.9g (of which saturates: 19.9g), Carbohydrate: 55g (of which sugars: 52.6g), Protein: 7.5g, Salt: 0.22g.",
        "image": "/assets/img/ChocFrog_800x.jpg"
    },
    {   
        "id": 1,
        "category": "bonbon",
        "name": "Fudge Flies",
        "price": 6.95,
        "description": "Indulge on these tasty Harry Potter Fudge Flies which are made up of unique pieces of milk chocolate, shaped like a fly. Fudge Flies were a favourite sweet of Scabbers, Ron Weasley’s pet rat given to him by his brother Percy. Ron told people at a party celebrating Gryffindor's victory in Quidditch, that Scabbers could have enjoyed some Fudge Flies if he hadn't been killed by Hermione Granger's pet cat, Crookshanks. Containing a delicious fudge flavouring, these are the perfect tasty treat for witches or wizards to share with their friends. Weighs approximately 113g.",
        "ingredients": "Sugar, Palm Kernel Oil, Cocoa Powder, Non-fat Milk Powder, Soy Lecithin (an emulsifier), Vanilla, Corn Syrup and Citric Acid (a preservative). Contains: MILK and SOY.",
        "allergy_advice": "For allergens, please see ingredients in bold. Shares equipment with and produced in a facility containing peanuts, tree nuts, milk, egg, wheat, and soy.",
        "image": "/assets/img/fudgeFlies.jpg"
    },
    {
        "id": 2,
        "category": "bonbon",
        "name": "Peppermint Toads",
        "price": 6.95,
        "description": "'Anything off the trolley, dears?' A long-time favourite from the shelves of Honeydukes Sweet Shop, are these magical dark chocolate Peppermint Toads. Each mouth-watering bite sized toad is infused with a distinctive peppermint flavour that is certain to leave you wanting more. Presented in themed packaging, the delicious Peppermint Toads make the perfect gift, or maybe a treat for yourself, they are sure to be a hit with any Harry Potter fan.",
        "ingredients": "Cocoa Mass, Sugar, Cocoa Butter, Emulsifier: Soya Lecithin, Natural Vanilla Flavouring, Peppermint Oil. Dark Chocolate Contains Cocoa Solids 53% minimum. Contains: SOY.",
        "allergy_advice": "For allergens, please see ingredients in bold. Shares equipment with and produced in a facility containing peanuts, tree nuts, milk, egg, wheat, and soy.",
        "image": "/assets/img/mintFrog.jpg"
    },
    {
        "id": 3,
        "category": "bonbon",
        "name": "Exploding Bon Bons",
        "price": 12.00,
        "description": "Why not try one of the more unusual Wizarding World treats, Exploding Bon Bons. These delicious small white chocolate sweets are filled with a tasty orange and pineapple flavoured truffle, the perfect sweet treat to make your mouth water. Hidden within the fruit flavoured centre is scrumptious popping candy pieces which crackle on your tongue, creating the exploding sensation from which they derive their name. Ten individually wrapped sweets are presented in a movie inspired box, which look as if it’s come straight off a shelf in Honeydukes sweet shop. The Exploding Bon Bons contents weigh approximately 90g.",
        "ingredients": "White Chocolate Coating, (Sugar, Palm Kernal Oil, Non-fat Milk Powder, Whole Milk Powder, Whey Powder, Palm Oil, Soy Lecithin (an emulsifier), Vanilla), Orange Popping Candy (Sugar, Maltose Syrup, Carbon Dioxide, Artificial Color (Yellow 6), Artificial Flavoring, Palm Kernel Oil with Soy Lecithin, Orange Oil, Artificial Flavour (Propylene Glycol, Artificial Flavors, Ethyl Alcohol, Water, Triacetin). Contains: MILK and SOY.",
        "allergy_advice": "For allergens, please see ingredients in bold. Shares equipment with and produced in a facility containing peanuts, tree nuts, milk, egg, wheat, and soy.",
        "image": "/assets/img/exploBonbon.jpg"
    },
    {
        "id": 4,
        "category": "bonbon",
        "name": "Fizzing Whizzbees Chocolate",
        "price": 12.00,
        "description": "'Anything off the trolley, dears?' Take home these Queen Bee Fizzing Whizzbees Chocolate, which are guaranteed to make your mouth go POP. These mouth-watering bee shaped milk chocolates contain fruit flavour popping candy. Made from a delicious combination of milk chocolate and cocoa butter, the crackling candy chocolate has been designed with packaging based on the Honeydukes candy shop from the Harry Potter film series. Perfect for any Harry Potter fan with a sweet tooth and a great gift for all witches and wizards.",
        "ingredients": "Milk Chocolate Coating (Sugar, Palm Oil Kernel, Cocoa Powder, Whey Powder, Non-fat Milk Powder, Soy Lecithin, (an emulsifier), Vanilla, Citric Acid (as a preservative), Popping Candy (Sugar, Maltose Syrup, Carbon Dioxide, Artificial Color (Red 40), Strawberry Flavor, and Flavoring (Artificial Flavors, Propylene Glycol, Ethyl Alcohol, Water, FD&C Red 40, FD&C Blue 1, Triacetin). Contains: MILK and SOY.",
        "allergy_advice": "For allergens, please see ingredients in bold. Shares equipment with and produced in a facility containing peanuts, tree nuts, milk, egg, wheat, and soy.",
        "image": "/assets/img/fizzy.jpg"
    },
    {
        "id": 5,
        "category": "bonbon",
        "name": "Honeydukes Milk Chocolate Honeycomb",
        "price": 8.95,
        "description": "‘Anything off the trolley, dears?’ Try one of the favourite flavours from Honeydukes sweet shop, with this delicious Honeydukes chocolate honeycomb. Inspired by the sweet treats available from Honeydukes aboard the Hogwarts Express, this tasty Milk Chocolate Honeycomb is the perfect treat to indulge in. Presented in a Honeydukes branded box, featuring film authentic graphics as seen on screen, Milk Chocolate Honeycomb is the perfect confection to share with a fellow witch or wizard. Weighs approximately 120g.",
        "ingredients": "Honeycomb Toffee (51%) (Sugar, Glucose Syrup, Raising Agent: Bicarbonate, Rice Flour), Milk Chocolate (49%) (Sugar, Whole Milk Powder, Cocoa Butter, Cocoa Mass, Emulsifier: Soya Lecithin, Vanilla Flavouring). Milk Chocolate Contains Cocoa Solids 30% minimum, milk solids 18% minimum.",
        "allergy_advice": "For allergens, please see ingredients in bold. May also contain traces of nuts.",
        "image": "/assets/img/milkHoney.jpg"
    },
    {
        "id": 6,
        "category": "bonbon",
        "name": "Bottled Butterbeer",
        "price": 8.95,
        "description": "Experience Butterbeer, the fan favourite drink from the Wizarding World in a brand new way at home! Best served chilled and poured straight from the bottle, the delicious soft drink features a new take on the butterscotch fans know and love. The unique blend of top-secret ingredients makes Harry Potter Bottled Butterbeer a must-try for any aspiring witch or wizard! Brewed in the UK, bottled Butterbeer is available to buy in souvenir glass bottles with a collectable label designed exclusively by MinaLima. Bottled Butterbeer is non-alcoholic, vegetarian, vegan and gluten-free. This enchanting beer does not contain actual butter! Maximum purchase of three individual bottles per order, but can also be purchased as a 4-pack.",
        "ingredients": "carbonated water, sugar, glucose syrup, pear juice concentrate, natural flavours, acid (lactic acid), fermented ginger root extract (water, glucose syrup, ginger root, pear juice concentrate, yeast), concentrate (apple, carrot, hibiscus), quillaia extract.",
        "allergy_advice": "For allergens, please see ingredients in bold.",
        "image": "/assets/img/butterbeer.jpg"
    },
    {
        "id": 7,
        "category": "bonbon",
        "name": "Butterbeer Jellybeans",
        "price": 2.95,
        "description": "Harry Potter Butterbeer, the sweet and iconic wizarding drink, now in a jelly bean! Tastes just like the real thing served at The Three Broomsticks! Grab & Go 28g bag - perfect for that delicious little treat.",
        "ingredients": "Sugar, glucose syrup, modified cornstarch, glazing agents (E904, E901, E903), concentrates of (carrot, apple, black currant, turmeric) for colour, flavourings, salt, colour (E150a). Alcohol free.",
        "image": "/assets/img/butterbeerjelly.jpg"
    },
    {
        "id": 8,
        "category": "bonbon",
        "name": "Butterbeer Gummies",
        "price": 4.95,
        "description": "Jelly Belly has really put their magical kitchens to work to bring you these Harry Potter Butterbeer gummies! This Butterbeer chewy candy comes in a fun tankard shape and tastes just like the real thing served at The Three Broomsticks. They're as delicious as they are entertaining and have the perfect soft chew. So raise a glass to the sweet and iconic wizarding drink and indulge in this enchanting treat!",
        "ingredients": "Sugar, glucose syrup, modified potato starch, water, flavourings, colours (E100, E150a), canola oil, coconut oil, salt, glazing agent (E903). Alcohol free.",
        "image": "/assets/img/ButterbeerGummies.jpg"
    },
    {
        "id": 9,
        "category": "bonbon",
        "name": "Bertie Bott's Every Flavour Beans",
        "price": 13.00,
        "description": "These gourmet jellybeans come in up to 20 flavors that range from delicious to disgusting, wrapped in the authentic Bertie Bott's Every Flavor Beans box. Flavors include marshmallow, tutti-frutti, grass, soap, and earwax. The assortment of beans are available in a decorated box based on the packaging created for the Harry Potter film series, and seen in the famous wizarding sweet shop Honeydukes, located in the all-wizarding village of Hogsmeade. The box of candy is complete with a bean flavor menu, will your choice be delicious or disgusting? Beans total approximately 6 oz.",
        "ingredients": "sugar, corn syrup, modified food starch, contains 2% or less of each of the following: blue-berry puree, lemon puree, banana puree, cherry juice concentrate, watermelon juice concentrate, apple juice concentrate, black pepper, citric acid, malic acid, maltodextrin, natural and artificial flavors, color added, red 40 lake, yellow 5 & 6, blue 1 & 2 lake, yellow 5 & 6 lake, blue 1, red 40, beeswax, carnauba wax, confectioner’s glaze, tapioca dextrin, salt.",
        "allergy_advice": "shares equipment with and produced in a facility containing peanuts, tree nuts, milk, egg, wheat, and soy. Made in the U.S.A.",
        "image": "/assets/img/beans.jpg"
    },
    {
        "id": 10,
        "category": "bonbon",
        "name": "Bertie Botts Beans Souvenir Tin",
        "price": 23.00,
        "description": "Take home these tasty gourmet jellybeans which come in up to 20 flavours. The flavours range from delicious to disgusting and are presented in the authentic Bertie Bott's Every Flavour Beans tin. Flavours include marshmallow, tutti-frutti, grass, soap, and earwax. Packaged in a decorated box based on the packaging created for the Harry Potter film series and complete with bean flavour menu. Beans total approximately 170g.",
        "ingredients": "Sugar, Glucose Syrup, Modified Corn Starch, Blueberry Puree, Flavourings, Acidity Regulators: E296, E330, E334, Banana Puree, Fruit and Vegetable Concentrates (Apple, Spirulina, Carrot, Blackcurrant, Pumpkin, Hibiscus), Colours: E100, E150a, E153, E162, E171; Glazing Agents: E901, E903, E904; Fruit Juice Concentrate (Watermelon, Apple, Cherry), Lemon Puree, Salt, Invert Sugar Syrup, Black Pepper, Tapioca Dextrin.",
        "allergy_advice": "For allergens, please see ingredients in bold. May also contain traces of nuts, peanuts, gluten, egg, soya, milk. Store in a cool dry place away from direct sunlight. Warning: E102,E110 and E129 may have an adverse effect on activity and attention in children. Produced in a factory which handles nuts. Not suitable for nut allergy sufferers. Nutritional information: Energy 1564/368Kj/kcal, Fat: 0g (of which saturates: 0g), Carbohydrate: 92g (of which sugars: 70g), Protein: 0g, Salt: 0.1g.",
        "image": "/assets/img/beansBis.jpg"
    },
    {
        "id": 11,
        "category": "beast",
        "name": "Niffler",
        "price": 123.00,
        "description": "The Niffler is a magical beast with a long snout and a coat of black, fluffy fur. They are attracted to shiny things, which made them wonderful for locating treasure, but that also meant that they could wreak havoc if kept (or let loose) indoors. Nifflers in general are usually harmless. Nifflers are rodent-like creatures with a long snout similar to that of a platypus and a coat of black, fluffy fur. Native to Britain, they live in burrows as deep as twenty feet below ground, and females produced six to eight young in a single litter.",
        "image": "/assets/img/niffler.png"
    },
    {
        "id": 12,
        "category": "beast",
        "name": "Moonclaf",
        "price": 250.00,
        "description": "The Mooncalf is a shy magical beast that only came out of its burrow during a full moon. The Mooncalf has smooth, pale grey skin, and four spindly legs that end in large flat webbed feet. The Mooncalf also has a very long neck and bulging blue eyes that sit on the top of its head. Once the Mooncalf is in the moonlight, it performes complicated dance moves while standing on its hind legs. It is believed that this is part of the Mooncalf mating ritual, but also has the side effect of creating geometric patterns in wheat fields that confused Muggles. Mooncalf dung, if harvested before the sun rose, would make magical plants grow fast and strong.",
        "image": "/assets/img/moonclaf.png"
    },
    {
        "id": 13,
        "category": "beast",
        "name": "Diricawl",
        "price": 299.00,
        "description": "The Diricawl (known to Muggles as the Dodo) is a plump, fluffy-feathered and flightless magical bird, native to the island of Mauritius in the Indian Ocean. It is capable of disappearing and reappearing elsewhere, except when under the effects of Levioso. While Muggles believe this bird to be extinct, but in reality, it exists and has the ability to disappear and reappear elsewhere as a means of escaping danger, similar to Apparition, while Muggles remaine unaware. The International Confederation of Wizards had not seen fit to reveal that the animal still existed, since it seemed to have raised Muggle awareness of the consequences of slaying their fellow creatures indiscriminately.",
        "image": "/assets/img/diricawl.png"
    },
    {
        "id": 14,
        "category": "beast",
        "name": "Demuiguise",
        "price": 379.00,
        "description": "The Demiguise is a peaceful, herbivorous magical beast that can make itself invisible and tell the future, both abilities which makes it very sought-after. However, it is hard to catch. It could be found in the Far East, but only wizards and witches trained in their capture could even see them. It resembles a cross between a sloth and an ape with large, black eyes and long, silky hair. Demiguise pelts are highly sought after as the hair can be woven into Invisibility Cloaks. Cloaks made from their hair eventually turned opaque, losing their invisibility effects as time passes. Demiguises has precognitive sight, so that the only way to catch them is to do something completely unpredictable. The Demiguise's ability to make itself invisible is used to symbolise the number zero, in the runic alphabet. Tincture of Demiguise could be extracted from Demiguises and used as a potion ingredient.",
        "image": "/assets/img/demuiguise.png"
    },
    {
        "id": 15,
        "category": "broom",
        "name": "Nimbus 2000",
        "price": 75.00,
        "description": "The Nimbus 2000 was a broomstick produced by the Nimbus Racing Broom Company as part of their successful line of racing brooms. At the time of its release in 1991, it was the fastest broomstick in production.",
        "image": "/assets/img/nimbus20002.png"
    },
    {
        "id": 16,
        "category": "broom",
        "name": "Nimbus 2001",
        "price": 99.00,
        "description": "The Nimbus 2001 was a broom produced by the Nimbus Racing Broom Company as part of their successful line of racing brooms. Released in August 1992, it was faster than its predecessor, the Nimbus 2000. The broom itself is black and silver with revolving stirrups.",
        "image": "/assets/img/nimbus2001.jpg"
    },
    {
        "id": 17,
        "category": "wand",
        "name": "Vine wand",
        "price": 45.00,
        "description": "Vine wands are among the less common types, and their owners are nearly always those witches or wizards who seek a greater purpose, who has a vision beyond the ordinary and who frequently astounds those who think they knew them best. Vine wands seem strongly attracted by personalities with hidden depths, and Garrick Ollivander himself has found them more sensitive than any other when it comes to instantly detecting a prospective match. Reliable sources claim that these wands can emit magical effects upon the mere entrance into their room of a suitable owner, and this has been noted to have occurred twice within Ollivanders.",
        "image": "/assets/img/vine.png"
    },
    {
        "id": 18,
        "category": "wand",
        "name": "Holly wand",
        "price": 45.00,
        "description": "According to Garrick Ollivander, holly is one of the rarer kinds of wand woods; traditionally considered protective, it works most happily for those who might need help overcoming a tendency to anger and impetuosity. At the same time, holly wands often chose owners who are engaged in some dangerous and often spiritual quest. Holly is one of those woods that varies most dramatically in performance depending on the wand core, and it is a notoriously difficult wood to team with phoenix feather, as the wood's volatility conflicts strangely with the phoenix's detachment. In the unusual event of such a pairing finding its ideal match, however, nothing and nobody should stand in their way.",
        "image": "/assets/img/holly.jpg"
    },
    {
        "id": 19,
        "category": "wand",
        "name": "Elder wand",
        "price": 45.00,
        "description": "The rarest wand wood of all, and reputed to be deeply unlucky, elder wands are considerably trickier to master than any other. They contains powerful magic, but scorn to remain with any owner who is not the superior of their company; it takes a remarkable wizard to keep an elder wand for any length of time. The old superstition, 'wand of elder, never prosper', has its basis in this fear of the wand, but in fact, the superstition is baseless, and those foolish wandmakers who refuse to work with elder do so more because they doubt they would be able to sell their products than from fear of working with this wood. The truth is that only a highly unusual person would find their perfect match in elder, and on the rare occasion when such a pairing occurrs, it might be taken as certain that the witch or wizard in question is marked out for a special destiny.",
        "image": "/assets/img/elder.jpg"
    },
    {
        "id": 20,
        "category": "wand",
        "name": "Walnut wand",
        "price": 45.00,
        "description": "According to Garrick Ollivander: 'Highly intelligent witches and wizards ought to be offered a walnut wand for trial first, because in nine cases out of ten, the two will find in each other their ideal mate. Walnut wands are often found in the hands of magical innovators and inventors; this is a handsome wood possessed of unusual versatility and adaptability. A note of caution, however: while some woods are difficult to dominate, and may resist the performance of spells that are foreign to their natures, the walnut wand will, once subjugated, perform any task its owner desires, provided that the user is of sufficient brilliance. This makes for a truly lethal weapon in the hands of a witch or wizard of no conscience, for the wand and the wizard may feed from each other in a particularly unhealthy manner.'",
        "image": "/assets/img/walnut.jpg"
    },
    {
        "id": 21,
        "category": "wand",
        "name": "Cypress wand",
        "price": 45.00,
        "description": "Garrick Ollivander noted that cypress wands are associated with nobility. The great medieval wandmaker, Geraint Ollivander, writes that he is always honoured to match a cypress wand, for he knows he is meeting a witch or wizard who would die a heroic death. Fortunately, in these less blood-thirsty times, the possessors of cypress wands are rarely called upon to lay down their lives, though doubtless many of them would do so if required. Wands of cypress find their soul mates among the brave, the bold and the self-sacrificing: those who are unafraid to confront the shadows in their own and others' natures.",
        "image": "/assets/img/cypress.jpg"
    }    
]